<h2><span style="font-family:Comic Sans MS; color:blue; font-size: ">Pandas Introduction</span></h2>

In [2]:
import numpy as np
import pandas as pd

#### Data Structures: Series

Create a serie with numbers 1 to 5 an index as a,b,c,d,e

In [14]:
s1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s1)
print(' ')
# Access third element
print(s1.iloc[2])
# Change value of second element
s1['b'] = 222
print(s1)
# Add 10 to all elements
s1 = s1 + 10
print(s1)
# Calculate sum of all elements
print(s1.sum())

a    1
b    2
c    3
d    4
e    5
dtype: int64

3
a      1
b    222
c      3
d      4
e      5
dtype: int64
a     11
b    232
c     13
d     14
e     15
dtype: int64
285

#### Data Structures: DataFrames

Create dataframe with 3 columns and 3 rows with numbers 1-9

In [15]:
df = pd.DataFrame(np.arange(1,10).reshape(3,3))
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Change the index to a,b,c and columns to col A, col B, col C

In [16]:
df.index = ['a','b','c']
df.columns = ['col A','col B','col C']
df

   col A  col B  col C
a      1      2      3
b      4      5      6
c      7      8      9

Access the data using different ways

In [26]:
print('By column name: \n', df['col A'])
print(' ')
print('By position: \n', df.iloc[:,0])
print(' ')
print('By index: \n', df.loc[:,'col A'])
print(' ')

By column name:
 a    1
b    4
c    7
Name: col A, dtype: int32

By position:
 a    1
b    4
c    7
Name: col A, dtype: int32

By index:
 a    1
b    4
c    7
Name: col A, dtype: int32

Access specific elements

In [27]:
print(df.iloc[1,1])
print(df.loc['b','col B'])

5
5

create new column with name col D and values 10, 11, 12

In [28]:
df['col D'] = [10,11,12]
df

   col A  col B  col C  col D
a      1      2      3     10
b      4      5      6     11
c      7      8      9     12

Create new row with index d and values 13,14,15,16

In [30]:
df.loc['d'] = [13,14,15,16]
df

   col A  col B  col C  col D
a      1      2      3     10
b      4      5      6     11
c      7      8      9     12
d     13     14     15     16

Add 10 to elements in col A

In [31]:
df['col A'] = df['col A'] + 10
df

   col A  col B  col C  col D
a     11      2      3     10
b     14      5      6     11
c     17      8      9     12
d     23     14     15     16

Calculate the sum of all elemetns

In [32]:
df.sum()

col A    65
col B    29
col C    33
col D    49
dtype: int64

Delete column col D using drop<br>
Note: axis=1 specifies we want to drop a column, not a row. In Pandas axis=0 refers to rows, axis=1 to columns

In [33]:
df.drop('col D', axis=1)

   col A  col B  col C
a     11      2      3
b     14      5      6
c     17      8      9
d     23     14     15

#### Functions

Given the series and dataframes below perform some operations (aritmethic, statistics...)

In [34]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])
d1 = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
d2 = pd.DataFrame([[7, 8, 9], [10, 11, 12]])

Sum s1 and s2

In [44]:
s1.add(s2)  # also can be s1 + s2

0    5
1    7
2    9
dtype: int64

Sum of d1 and d2

In [45]:
d1.add(d2)

    0   1   2
0   8  10  12
1  14  16  18

Calculate the mean for s1

In [47]:
s1.mean()

2.0

Calculate the median for s1

In [48]:
s1.median()

2.0

Count number of elements in s1

In [49]:
s1.count()

3

Calculate standard deviation for s1

In [50]:
s1.std()

1.0

Calculate variance for s1

In [52]:
s1.var()

1.0

Calculate maximum value for s1

In [54]:
s1.max()

3

Calculate minimum value for s1

In [55]:
s1.min()

1

Calculate correlation between s1 and s2

In [56]:
s1.corr(s2)

1.0

Statistic summary for s1

In [60]:
s1.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

#### Custom Functions

Given the serie below, create custom functions

In [71]:
serie = pd.Series([1,2,3,4,5])

Define a square function to apply to the serie

In [72]:
def squared(x):
    return x**2

serie.apply(squared)

0     1
1     4
2     9
3    16
4    25
dtype: int64

Now the same function but using lambda

In [74]:
serie1 = pd.Series([6,7,8,9,10])
serie1 = serie1.apply(lambda x: x**2)
serie1

0     36
1     49
2     64
3     81
4    100
dtype: int64

Given the dataframe below, create custom functions

In [75]:
df = pd.DataFrame({
    'A': [1,2,3],
    'B': [4,5,6]
})

Apply lambda function to col A

In [76]:
df['A'] = df['A'].apply(lambda x: x**2)
df

   A  B
0  1  4
1  4  5
2  9  6

Apply same function to row 1

In [77]:
df.iloc[0] = df.iloc[0].apply(lambda x: x**2)
df

   A   B
0  1  16
1  4   5
2  9   6

Apply same function to all elements

In [81]:
df.map(lambda x: x**2)
df

      A      B
0     1  65536
1   256    625
2  6561   1296